export const enum StpPropFields {
    id = "id",
    formula = "Формула стеклопакета",
    stp_type = "Тип стеклопакета",

}

export const enum _EnFieldsStp {
    cams = "Кол-во камер",
    depth = "Толщина",
    Ro = "Коэффециент сопротивления теплопередачи, Ro",
    Ug = "Коэффециент теплопередачи стеклопакета, Ug",
    Rw = "Звукоизоляция, Rw",
    LT = "Светопропускание, Lt",
    LR = "Светоотражение, Lr",
    Ra = "Уровень приемлемой цветопередачи, Ra",
    DET = "Прямое пропускание энергии солнечного излучения, Det",
    ER = "Отражение солнечной энергии, Er",
    EA = "Поглощение солнечной энергии, Ea",
    SF = "Коэффициент общего пропускания солнечной энергии, Sf",
    SC = "Коэффициент затемнения, Sc",
    S = "Соотношение многофункциональности стеклопакета (селективность), S",
    Weight = "Вес 1 кв.м. стеклопакета",
    id = "id",
    formula = "Формула стеклопакета",
}

export const enum Stp_TypeFields {
    simple = "Простой",
    multi = "Мультифункциональный",
    triplex = "Триплекс",
    soundproof = "Шумоизоляционный",
    hitproof = "Противоударный",
    solarproof = "Солнцеотражающий",
}